Revit 2027 API
ExportLineweightKey.OriginalLineweight Property
 The original line weight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int OriginalLineweight { get; set; }
Public Property OriginalLineweight As Integer
	Get
	Set
public:
property int OriginalLineweight {
	int get ();
	void set (int value);
}
member OriginalLineweight : int with get, set
Property Value
Int32
See Also
Reference
ExportLineweightKey Class
Autodesk.Revit.DB Namespace